<template>
  <div class="about">
    <h2>Пункты навигации</h2>
    <h4>Простая</h4>
    <p>статическая и бесконечная пагинация</p>
    <p>Фильтрация по двум, но можно и более столбцам</p>
    <p>Многоуровневая сортировка</p>
    <h4>Виртуальный скролл</h4>
    <p>виртуальный скролл по уже загруженным данным(!!! мне не удалось добиться нормальной работоспособности)</p>
    <h4>Оценка производительности</h4>
    <p>Сложно оценить, так как, по моему мнеию, Vue dev tools не видят функциональных компонент</p>
    <img src="../assets/components.png" />
    <p>Это с простыми компонентами</p>
    <img src="../assets/func-components.png" />
    <p>Это с функциональными компонентами</p>
    <p></p>
    <p>Я еще пробовал оценить с помощью performance обычных dev tools, и там получилось одинаковое время</p>


  </div>
</template>


<style scoped>
.about {
  text-align: left;
}
</style>
